
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановкаПараметровДинамическогоСписка();
	
КонецПроцедуры

&НаСервере
Процедура УстановкаПараметровДинамическогоСписка();
	
	//Список.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДатаСеанса());
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьДатуЗапрета(Команда)
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаДень"
		, Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(ТекущаяДата()) - 1, НачалоМесяца(ТекущаяДата()) - 1)
		, ЭтотОбъект
		, Новый УникальныйИдентификатор,,
		, Новый ОписаниеОповещения("ВыборДатыЗапрета_Завершение", ЭтотОбъект)
		,);
КонецПроцедуры

&НаКлиенте
Процедура ВыборДатыЗапрета_Завершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	МассивОрганизаций = Новый Массив;
	Для Каждого Элемент Из Элементы.Список.ВыделенныеСтроки Цикл
		МассивОрганизаций.Добавить(Элемент);		
	КонецЦикла;
	
	ОчиститьСообщения();
	
	//////////////////////////////////////////////////////////////
	//
	СтруктураФоновогоЗадания = ЗапуститьВыполнениеВФоне(УникальныйИдентификатор
		,
		, Новый Структура("ДатаЗапрета,Организации",Результат.КонецПериода, МассивОрганизаций)
	);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);		
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	// указываем интервал обновления состояния в секундах, если не указать, 
	// то интервал будет увеличиваться при каждой итерации в 1.4 раза.
	ПараметрыОжидания.Интервал = 2;		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания,
		Новый ОписаниеОповещения("ФоновоеЗаполненияЗавершено", ЭтотОбъект),
		ПараметрыОжидания
	);
		
КонецПроцедуры 

&НаСервере
Функция ЗапуститьВыполнениеВФоне(ИдентификаторФормы, Многопоточно = Ложь, ПараметрыВызова)
	
	//ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Список, "НеИспользовать");
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ПрерватьВыполнениеЕслиОшибка = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
		"РегистрыСведений.ДатыЗапретаРедактированияБанковскихИКассовыхОперацийОрганизаций.УстановитьДатуЗапретаРедактирования", 
		ПараметрыВызова, 
		АдресХранилища
	);	
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаполненияЗавершено(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьОповещениеПользователя("Установка даты запрета произшло с ошибкой",, Результат.ПодробноеПредставлениеОшибки, БиблиотекаКартинок.Ошибка32,);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		ПоказатьОповещениеПользователя("Завершена установка даты запрета в 8",,, БиблиотекаКартинок.Успешно32);
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры
