Диалог: 
{
	Параметры формы: 
	{
		Параметры: 
		{
			Ширина: 240
			Высота: 200
			Param24: 6
			Param25: 25
			Слои
			{
				Основной: Видимый
				Параметры: Видимый, Активный
				УсловияПолучения: 
				ВидыРасхода: 
				УсловияПолучения2003: 
				ВидыРасхода2003: 
			}
		}
	}
	Элементы: 
	{
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 73
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4152
			Формула: "Установить(СписокВидовРасходов2003)"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Инвертировать пометки"
			ShortHint: "Инвертировать отметки"
			Пиктограмма: 0x10000028
			Слой: ВидыРасхода2003
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 58
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4153
			Формула: "Установить(СписокВидовРасходов2003, ""Сброс"")"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Снять все пометки"
			ShortHint: "Снять все отметки"
			Пиктограмма: 0x10000029
			Слой: ВидыРасхода2003
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 43
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4154
			Формула: "Установить(СписокВидовРасходов2003, ""Все"")"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Пометить все"
			ShortHint: "Отметить все"
			Пиктограмма: 0x10000027
			Слой: ВидыРасхода2003
		}
		LISTBOX: СписокВидовРасходов2003
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag8, Flag21, Flag23, Flag28, Flag30
			X: 10
			Y: 43
			Ширина: 205
			Высота: 135
			ПорядокОбхода: 4155
			ОснФлаги: СПометками
			Слой: ВидыРасхода2003
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 73
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4156
			Формула: "Установить(СписокУсловийПолучения2003)"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Инвертировать пометки"
			ShortHint: "Инвертировать отметки"
			Пиктограмма: 0x10000028
			Слой: УсловияПолучения2003
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 58
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4157
			Формула: "Установить(СписокУсловийПолучения2003, ""Сброс"")"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Снять все пометки"
			ShortHint: "Снять все отметки"
			Пиктограмма: 0x10000029
			Слой: УсловияПолучения2003
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 43
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4158
			Формула: "Установить(СписокУсловийПолучения2003, ""Все"")"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Пометить все"
			ShortHint: "Отметить все"
			Пиктограмма: 0x10000027
			Слой: УсловияПолучения2003
		}
		LISTBOX: СписокУсловийПолучения2003
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag8, Flag21, Flag23, Flag28, Flag30
			X: 10
			Y: 43
			Ширина: 205
			Высота: 135
			ПорядокОбхода: 4159
			ОснФлаги: СПометками
			Слой: УсловияПолучения2003
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 73
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4160
			Формула: "Установить(СписокВидовРасходов)"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Инвертировать пометки"
			ShortHint: "Инвертировать отметки"
			Пиктограмма: 0x10000028
			Слой: ВидыРасхода
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 58
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4161
			Формула: "Установить(СписокВидовРасходов, ""Сброс"")"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Снять все пометки"
			ShortHint: "Снять все отметки"
			Пиктограмма: 0x10000029
			Слой: ВидыРасхода
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 43
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4162
			Формула: "Установить(СписокВидовРасходов, ""Все"")"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Пометить все"
			ShortHint: "Отметить все"
			Пиктограмма: 0x10000027
			Слой: ВидыРасхода
		}
		LISTBOX: СписокВидовРасходов
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag8, Flag21, Flag23, Flag28, Flag30
			X: 10
			Y: 43
			Ширина: 205
			Высота: 135
			ПорядокОбхода: 4163
			ОснФлаги: СПометками
			Слой: ВидыРасхода
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 73
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4164
			Формула: "Установить(СписокУсловийПолучения)"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Инвертировать пометки"
			ShortHint: "Инвертировать отметки"
			Пиктограмма: 0x10000028
			Слой: УсловияПолучения
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 58
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4165
			Формула: "Установить(СписокУсловийПолучения, ""Сброс"")"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Снять все пометки"
			ShortHint: "Снять все отметки"
			Пиктограмма: 0x10000029
			Слой: УсловияПолучения
		}
		BUTTON: 
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 218
			Y: 43
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4166
			Формула: "Установить(СписокУсловийПолучения, ""Все"")"
			ОснФлаги: КартинкаПоЦентру
			Hint: "Пометить все"
			ShortHint: "Отметить все"
			Пиктограмма: 0x10000027
			Слой: УсловияПолучения
		}
		LISTBOX: СписокУсловийПолучения
		{
			ДопФлаги: Flag0, Flag8, Flag21, Flag23, Flag28, Flag30
			X: 10
			Y: 43
			Ширина: 205
			Высота: 135
			ПорядокОбхода: 4167
			ОснФлаги: СПометками
			Слой: УсловияПолучения
		}
		STATIC: 
		{
			Заголовок: "Виды расхода, которым соответствуют операции, включаемые в регистр, устанавливаются на закладке  ""Виды расхода"""
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag28, Flag30
			X: 14
			Y: 132
			Ширина: 210
			Высота: 25
			ПорядокОбхода: 4168
			ОснФлаги: ШрифтПоУмолчанию
			ЦветТекста: 8388608
			Слой: Параметры
		}
		STATIC: ВидыРасходаФильтр
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag9, Flag28, Flag30
			X: 86
			Y: 117
			Ширина: 85
			Высота: 13
			ПорядокОбхода: 4169
			ОснФлаги: ЦветТекстаАвто
			Шрифт: MS Sans Serif
			{
				Жирный: Да
				Param9: 204
				Param13: 34
			}
			Слой: Параметры
		}
		STATIC: 
		{
			Заголовок: "Виды расхода:"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag9, Flag28, Flag30
			X: 14
			Y: 117
			Ширина: 69
			Высота: 13
			ПорядокОбхода: 4170
			Шрифт: MS Sans Serif
			{
			}
			Слой: Параметры
		}
		STATIC: 
		{
			Заголовок: "Условия получения имущества, работ, услуг, прав, которым соответствуют операции, включаемые в регистр, устанавливаются на закладке ""Условия получения"""
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag28, Flag30
			X: 14
			Y: 90
			Ширина: 210
			Высота: 25
			ПорядокОбхода: 4171
			ОснФлаги: ШрифтПоУмолчанию
			ЦветТекста: 8388608
			Слой: Параметры
		}
		STATIC: УсловияПолученияФильтр
		{
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag9, Flag28, Flag30
			X: 86
			Y: 75
			Ширина: 85
			Высота: 13
			ПорядокОбхода: 4172
			ОснФлаги: ЦветТекстаАвто
			Шрифт: MS Sans Serif
			{
				Жирный: Да
				Param9: 204
				Param13: 34
			}
			Слой: Параметры
		}
		STATIC: 
		{
			Заголовок: "Условия получения:"
			ДопФлаги: Flag9, Flag28, Flag30
			X: 14
			Y: 75
			Ширина: 69
			Высота: 13
			ПорядокОбхода: 4173
			Шрифт: MS Sans Serif
			{
			}
			Слой: Параметры
		}
		1CGROUPBOX: 
		{
			Заголовок: "Условия формирования регистра"
			ДопФлаги: Flag0, Flag1, Flag2, Flag28, Flag30
			X: 8
			Y: 64
			Ширина: 222
			Высота: 113
			ПорядокОбхода: 4174
			Слой: Параметры
		}
		BUTTON: ВыбПериода
		{
			Заголовок: "..."
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 184
			Y: 44
			Ширина: 15
			Высота: 13
			ПорядокОбхода: 4175
			Формула: "ВвестиПериод(НачДата,КонДата)"
			Слой: Параметры
		}
		BMASKED: КонДата
		{
			ИдентификаторМетаданных: -1
			Тип: Дата
			ДопФлаги: Flag23, Flag28, Flag30
			X: 126
			Y: 44
			Ширина: 54
			Высота: 13
			ПорядокОбхода: 4176
			ОснФлаги: Педалька
			Слой: Параметры
		}
		STATIC: 
		{
			Заголовок: "по"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag1, Flag9, Flag28, Flag30
			X: 108
			Y: 44
			Ширина: 14
			Высота: 13
			ПорядокОбхода: 4177
			Шрифт: MS Sans Serif
			{
				Размер: 10
				Жирный: Да
				Param9: 204
				Param10: 1
				Param11: 2
				Param12: 1
				Param13: 34
			}
			ЦветТекста: 8388608
			Слой: Параметры
		}
		BMASKED: НачДата
		{
			ИдентификаторМетаданных: -1
			Тип: Дата
			ДопФлаги: Flag23, Flag28, Flag30
			X: 51
			Y: 44
			Ширина: 54
			Высота: 13
			ПорядокОбхода: 4178
			ОснФлаги: Педалька
			Слой: Параметры
		}
		STATIC: 
		{
			Заголовок: "с"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag1, Flag9, Flag28, Flag30
			X: 39
			Y: 44
			Ширина: 8
			Высота: 13
			ПорядокОбхода: 4179
			Шрифт: MS Sans Serif
			{
				Размер: 10
				Жирный: Да
				Param9: 204
				Param10: 1
				Param11: 2
				Param12: 1
				Param13: 34
			}
			ЦветТекста: 8388608
			Слой: Параметры
		}
		BUTTON: 
		{
			Заголовок: "Закрыть"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, Flag28, Flag30
			X: 68
			Y: 182
			Ширина: 54
			Высота: 13
			ПорядокОбхода: 4180
			Формула: "#Закрыть"
			Слой: Основной
		}
		BUTTON: 
		{
			Заголовок: "С&формировать"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag1, КартинкаПоЦентру, КнопкаПоУмолчанию, Flag28, Flag30
			X: 6
			Y: 182
			Ширина: 60
			Высота: 13
			ПорядокОбхода: 4181
			Формула: "Сформировать()"
			Слой: Основной
		}
		STATIC: 
		{
			Заголовок: "Регистр учета операций приобретения имущества, работ, услуг, прав"
			ИдентификаторМетаданных: -1
			ДопФлаги: Flag0, Flag28, Flag30
			X: 7
			Y: 19
			Ширина: 225
			Высота: 22
			ПорядокОбхода: 4182
			Шрифт: MS Sans Serif
			{
				Размер: 10
				Жирный: Да
				Param9: 204
				Param10: 1
				Param11: 2
				Param12: 1
				Param13: 34
			}
			ЦветТекста: 8388608
			Слой: Основной
		}
	}
}
