#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МесяцРегистрацииСтрокойПриОткрытии();
	
КонецПроцедуры
#КонецОбласти

#Область СобытияЭлементовФормы
#Область МесяцРегистрации

&НаКлиенте
Процедура МесяцРегистрацииСтрокойПриОткрытии()
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда 
		ЭтаФорма.МесяцРегистрацииСтрокой = Формат(Объект.ПериодРегистрации,"ДФ=""ММММ гггг""");	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура МесяцРегистрацииСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой");	
	ПериодРегистрацииПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПериодРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", , Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцРегистрацииСтрокой", Направление,,);	
	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
	ПериодРегистрацииПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	ПериодРегистрацииПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура ПериодРегистрацииПриИзменении()
	
	//Объект.КредитныеДоговора.Очистить();
	//Объект.Итоги.Очистить();
КонецПроцедуры

#КонецОбласти
#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ ТАБЛИЧНОГО ДОКУМЕНТА

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(
	Элементы.Результат,
	ЭтотОбъект,
	"Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОчиститьСообщения();

	//////////////////////////////////////////////////////////////
	//
 	СтруктураФоновогоЗадания = ЗапуститьВыполнениеВФоне(УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);		
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	// указываем интервал обновления состояния в секундах, если не указать, 
	// то интервал будет увеличиваться при каждой итерации в 1.4 раза.
	ПараметрыОжидания.Интервал = 3;		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания,
		Новый ОписаниеОповещения("ФоновоеЗаполненияЗавершено", ЭтотОбъект),
		ПараметрыОжидания
	);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВ7(Команда)
	ДанныеДляПередачи = ПодготовитьДанныеДляПередачи();
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПередатьВ7Далее", ЭтотОбъект, Новый Структура("Период,Счет,Данные", Объект.ПериодРегистрации, КодСчета, ДанныеДляПередачи)),
		"Передать в 7?",
		РежимДиалогаВопрос.ДаНет
	);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Функция ЗапуститьВыполнениеВФоне(ИдентификаторФормы, Многопоточно = Ложь)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	ПараметрыОтчета = ПодготовитьПараметрыОтчета();
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ЗапуститьВФоне = Ложь;
	ПараметрыВыполнения.ПрерватьВыполнениеЕслиОшибка = Истина;
	
	Если Многопоточно Тогда
		ПараметрыПроцедуры = Новый Массив;
		ПараметрыПроцедуры.Добавить(ПараметрыОтчета);
		ПараметрыПроцедуры.Добавить(АдресХранилища);
		с = Новый Соответствие;
		с.Вставить("Параметры", ПараметрыПроцедуры);
		Возврат ДлительныеОперации.ВыполнитьПроцедуруВНесколькоПотоков("мммОтчетЗатратыСервер.СформироватьОтчетОСВ",//СформироватьЭтотОтчет",
			ПараметрыВыполнения,
			с
		);
	Иначе	
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
			"ОтчетОСВВызовСервера.СформироватьОтчетОСВ", 
			ПараметрыОтчета, 
			АдресХранилища
		);	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаполненияЗавершено(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		// обрабатываем результат
		
		Кодировка = "windows-1251"; // КодировкаТекста.ANSI;
		РезультатВыполнения = ОбработатьДанныеНаСервере(Результат.АдресРезультата);
		
		Рез = ПолучитьИзВременногоХранилища(АдресХранилища);
		
		ИмяОрганизации = ?(Организация.Количество()=1, Рез.ИмяОрганизации, "МММ");
		ТаблДокумент = Рез.ТаблДокумент;
		//ДвоичнДанные = Рез.ДвоичнДанныеВыгрузки;
		МассивОрганизацийСОшибками = Рез.МассивОрганизацийСОшибками;
		Для Каждого Эл Из МассивОрганизацийСОшибками Цикл
			СтрокаСообщения = "ПоОрганизации %1 отчет выполнился с ошибкой";
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, Эл);
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		КонецЦикла;				
		
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ОбработатьДанныеНаСервере(АдресРезультата)
	
	ЗагрузитьПодготовленныеДанные();
	РезультатВыполнения = Новый Структура("ЗаданиеВыполнено,АдресХранилища", Истина, АдресРезультата);
	Возврат РезультатВыполнения;
	
	
	//Данные = ПолучитьИзВременногоХранилища(АдресРезультата);
	//Если НЕ Данные = Неопределено Тогда
	//	Объект.Остатки.Очистить();
	//	тз = Объект.Остатки.Выгрузить();
	//	тз.Очистить();
	//	Для Каждого ТекД Из Данные Цикл
	//		Если ТекД.Значение.Статус = "Выполнено" Тогда
	//			Результат = ПолучитьИзВременногоХранилища(ТекД.Значение.АдресРезультата);	
	//			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат, тз);			
	//	    КонецЕсли;
	//	КонецЦикла;
	//	тз.Свернуть("Счет, Организация, Счет7", "СуммаОстатка");
	//	Объект.Остатки.Загрузить(тз);
	//КонецЕсли;	
	
КонецФункции	
////////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	Результат.Очистить();
	
	Результат.Вывести(ПолучитьИзВременногоХранилища(АдресХранилища).ТаблДокумент);
	
	//Отчет.НомерОтчета = Отчет.НомерОтчета + 1;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПодготовитьПараметрыОтчета()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация"                       , Организация.ВыгрузитьЗначения());
	ПараметрыОтчета.Вставить("Счета"  		                     , ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КодСчета));
	ПараметрыОтчета.Вставить("НачалоПериода"                     , НачалоДня(Объект.ПериодРегистрации));
	ПараметрыОтчета.Вставить("КонецПериода"                      , КонецМесяца(Объект.ПериодРегистрации));
	ПараметрыОтчета.Вставить("Склад"                             , Неопределено);
	ПараметрыОтчета.Вставить("НомерОтчета"                       , Неопределено);
	ПараметрыОтчета.Вставить("ВключатьОбособленныеПодразделения" , Ложь);
	ПараметрыОтчета.Вставить("Субконто1" , ОтборСубконто);
	
	//тзО = ОрганизацииСОшибками.Выгрузить();
	//МассивСтрок = тзО.НайтиСтроки(Новый Структура("Пометка", Истина));
	//тзО1 = тзО.Скопировать(МассивСтрок, "Организация");
	//
	//Если Элементы.ОрганизацииСОшибками.Видимость И	тзО1.Количество() Тогда
	//	ПараметрыОтчета.Организация = тзО1.ВыгрузитьКолонку("Организация");
	//КонецЕсли;	
	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
	Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
	ПолеСумма, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьСуществованиеКаталога(ИмяКаталога) Экспорт
	
	КаталогНаДиске = Новый Файл(ИмяКаталога);
	Если КаталогНаДиске.Существует() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеДляПередачи()
	
	Массив = Новый Массив;
	Для Стр = 5 По Результат.ВысотаТаблицы Цикл
		ТекЗапись = Результат.Область(Стр, 2, Стр, 2);
		Если ПустаяСтрока(ТекЗапись.Текст) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивОрганизация = СтрРазделить(ТекЗапись.Текст, ",", Ложь);
		
		Массив.Добавить(Новый Структура("Организация,НачДт,НачКт,ОбДт,ОбКт,КонДт,КонКт",
				СокрЛП(МассивОрганизация[1]),
				СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Результат.Область(Стр, 3, Стр, 3).Текст),
				СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Результат.Область(Стр, 4, Стр, 4).Текст),
				СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Результат.Область(Стр, 5, Стр, 5).Текст),
				СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Результат.Область(Стр, 6, Стр, 6).Текст),
				СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Результат.Область(Стр, 7, Стр, 7).Текст),
				СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Результат.Область(Стр, 8, Стр, 8).Текст)
			)
		);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ПередатьВ7Далее(Результат, ПараметрыПередачи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		БазаОле = мммКлиент.ПодключитьсяКБазеМММКлиент();
		
		Если Не БазаОле = Неопределено Тогда
			Док = Неопределено;
			Если Лев(ПараметрыПередачи.Счет, 2) = "51" Тогда
				Док = БазаОле.CreateObject("Документ.Данные51Из8");
			ИначеЕсли Лев(ПараметрыПередачи.Счет, 2) = "50" Тогда
				Док = БазаОле.CreateObject("Документ.Данные50Из8");
			ИначеЕсли Лев(ПараметрыПередачи.Счет, 2) = "60" Тогда
				Док = БазаОле.CreateObject("Документ.Данные60Из8");
			ИначеЕсли Лев(ПараметрыПередачи.Счет, 2) = "62" Тогда
				Док = БазаОле.CreateObject("Документ.Данные62Из8");
			Иначе
				Попытка
					Док = БазаОле.CreateObject("Документ.Данные"+Лев(ПараметрыПередачи.Счет, 2)+"Из8");
				Исключение
					ВызватьИсключение("Удалось в приемнике найти документ для " + Лев(ПараметрыПередачи.Счет, 2) + " счета");
				КонецПопытки;
			КонецЕсли;

			Если Док.ВыбратьДокументы(ПараметрыПередачи.Период, КонецМесяца(ПараметрыПередачи.Период)) Тогда
				
				Пока Док.ПолучитьДокумент() Цикл
					
					Если СтрНайти(НРег(ОтборСубконто), "матер") > 0 И НЕ СтрНайти(НРег(Док.Комментарий), "матер") > 0 Тогда
						Продолжить;
					КонецЕсли;
					Если СтрНайти(НРег(ОтборСубконто), "товар") > 0 И НЕ СтрНайти(НРег(Док.Комментарий), "товар") > 0 Тогда
						Продолжить;
					КонецЕсли;
					Если (СтрНайти(НРег(ОтборСубконто), "поставщик") > 0 И НЕ СтрНайти(НРег(Док.Комментарий), "поставщик") > 0)
						Или (ВРег(ОтборСубконто) = "ОПТ" И  НЕ СтрНайти(НРег(Док.Комментарий), "поставщик") > 0) Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаНайдена = Ложь;
					
					Для Каждого Стр8 Из ПараметрыПередачи.Данные Цикл
						Док.ВыбратьСтроки();
						Пока Док.ПолучитьСтроку() = 1 Цикл
							Если СокрЛП(Док.рСчет.Инн) = Стр8.Организация Тогда
								Док.НачОстаток = Стр8.НачДт - Стр8.НачКт;
								Док.ОборотДт = Стр8.ОбДт;
								Док.ОборотКт = Стр8.ОбКт;
								Док.КонОстаток = Стр8.КонДт - Стр8.КонКт;
								
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
					
					Док.Записать();
					Док.Провести();
				
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ПоказатьОповещениеПользователя("Передано",,, БиблиотекаКартинок.Успешно32);	
КонецПроцедуры



