
Функция RunQuery(strQuery)
	
	Данные = мммСервер.ДеСериализовать(strQuery);
	
	Если НЕ Данные.Свойство("ТекстЗапроса") Тогда
		Возврат мммСервер.Сериализовать(
			мммСервер.ПодготовитьСтруктуруОтвета(Истина, "Параметр не содержит в себе ТекстЗапроса")
		);
	КонецЕсли;	
	
	Запрос = Новый Запрос;	
	Запрос.Текст = Данные.ТекстЗапроса;
	Если Данные.Свойство("Параметры") Тогда
		Для Каждого Параметр Из Данные.Параметры Цикл
			Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);	
		КонецЦикла;	
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат мммСервер.Сериализовать(
			мммСервер.ПодготовитьСтруктуруОтвета(Истина, "Ошибка выполнения запроса")
		);		
	КонецЕсли;
	
	Возврат мммСервер.Сериализовать(мммСервер.ПодготовитьСтруктуруОтвета(,,РезультатЗапроса.Выгрузить()));
	
КонецФункции

Функция RunCode(strCode)
	
	ВозвращаемоеЗначение = Неопределено;

	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Выполнить(strCode);
		УстановитьПривилегированныйРежим(Ложь);
		Возврат мммСервер.Сериализовать(
			мммСервер.ПодготовитьСтруктуруОтвета(Ложь,,ВозвращаемоеЗначение)
		);		
	Исключение
		Возврат мммСервер.Сериализовать(
			мммСервер.ПодготовитьСтруктуруОтвета(Истина, ОписаниеОшибки())
		);		
	КонецПопытки;
	
	
КонецФункции

Функция CallMethod(Method, Object, Period)
	
	//Возврат ""+ТипЗнч(Period)+"_"+Period;
	
	Если Method = "ОСВ51" Тогда
		Результат = ПолучитьОСВ51(мммСервер.ПолучитьОрганизациюПоИНН(Object), Period);
		Возврат СериализоватьКакСтроку(Результат);

	ИначеЕсли Method = "ОСВ50" Тогда
		Результат = ПолучитьОСВ50(мммСервер.ПолучитьОрганизациюПоИНН(Object), Period);
		Возврат СериализоватьКакСтроку(Результат);

	ИначеЕсли Method = "ОСВ60" Тогда
		Результат = ПолучитьОСВ60(мммСервер.ПолучитьОрганизациюПоИНН(Object), Period);
		Возврат СериализоватьКакСтроку(Результат);

	ИначеЕсли Method = "ОСВ62" Тогда
		Результат = ПолучитьОСВ62(мммСервер.ПолучитьОрганизациюПоИНН(Object), Period);
		Возврат СериализоватьКакСтроку(Результат);

	КонецЕсли;
	
	Возврат мммСервер.Сериализовать(
		мммСервер.ПодготовитьСтруктуруОтвета(Истина, "Нет реализации вызываемого метода")
	);
	
КонецФункции

///////////////////////////////////////////////////////////
// 51

Функция ПолучитьОСВ51(Организация, Период)

	Параметры = мммСервер.ПодготовитьПараметрыОтчета(Организация,
		РегистрыСведений.Меппинг.ПолучитьЗамену(Организация, "51"),
		НачалоМесяца(Период),
		КонецМесяца(Период)
	);
	Параметры.Вставить("КолокиТаблицыЗначений", "Счет,СуммаНачальныйОстатокДт,СуммаНачальныйОстатокКт,СуммаОборотДт,СуммаОборотКт,СуммаКонечныйОстатокДт,СуммаКонечныйОстатокКт");

	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ОтчетОСВВызовСервера.СформироватьОтчетОСВ(Параметры, АдресХранилища);
	
	Данные = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если Данные.ТаблицаЗначений.Количество() > 0 Тогда
		ТекДанные = Данные.ТаблицаЗначений[0];
		
		Результат = Новый Массив;
		Результат.Добавить(Формат(ТекДанные.СуммаНачальныйОстатокДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаНачальныйОстатокКт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.ОборотДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.ОборотКт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаКонечныйОстатокДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаКонечныйОстатокКт, "ЧГ="));

		Возврат Результат;

	КонецЕсли;

	Возврат "";

КонецФункции

///////////////////////////////////////////////////////////
// 50

Функция ПолучитьОСВ50(Организация, Период)

	Параметры = мммСервер.ПодготовитьПараметрыОтчета(Организация,
		РегистрыСведений.Меппинг.ПолучитьЗамену(Организация, "50"),
		НачалоМесяца(Период),
		КонецМесяца(Период)
	);
	Параметры.Вставить("КолокиТаблицыЗначений", "Счет,СуммаНачальныйОстатокДт,СуммаНачальныйОстатокКт,СуммаОборотДт,СуммаОборотКт,СуммаКонечныйОстатокДт,СуммаКонечныйОстатокКт");

	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ОтчетОСВВызовСервера.СформироватьОтчетОСВ(Параметры, АдресХранилища);
	
	Данные = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если Данные.ТаблицаЗначений.Количество() > 0 Тогда
		ТекДанные = Данные.ТаблицаЗначений[0];
		
		Результат = Новый Массив;
		Результат.Добавить(Формат(ТекДанные.СуммаНачальныйОстатокДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаНачальныйОстатокКт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.ОборотДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.ОборотКт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаКонечныйОстатокДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаКонечныйОстатокКт, "ЧГ="));

		Возврат Результат;

	КонецЕсли;

	Возврат "";

КонецФункции

///////////////////////////////////////////////////////////
// 60

Функция ПолучитьОСВ60(Организация, Период)

	Параметры = мммСервер.ПодготовитьПараметрыОтчета(Организация,
		РегистрыСведений.Меппинг.ПолучитьЗамену(Организация, "60"),
		НачалоМесяца(Период),
		КонецМесяца(Период)
	);
	Параметры.Вставить("КолокиТаблицыЗначений", "Счет,СуммаНачальныйОстатокДт,СуммаНачальныйОстатокКт,СуммаОборотДт,СуммаОборотКт,СуммаКонечныйОстатокДт,СуммаКонечныйОстатокКт");

	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ОтчетОСВВызовСервера.СформироватьОтчетОСВ(Параметры, АдресХранилища);
	
	Данные = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если Данные.ТаблицаЗначений.Количество() > 0 Тогда
		ТекДанные = Данные.ТаблицаЗначений[0];
		
		Результат = Новый Массив;
		Результат.Добавить(Формат(ТекДанные.СуммаНачальныйОстатокДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаНачальныйОстатокКт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.ОборотДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.ОборотКт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаКонечныйОстатокДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаКонечныйОстатокКт, "ЧГ="));

		Возврат Результат;

	КонецЕсли;

	Возврат "";

КонецФункции

///////////////////////////////////////////////////////////
// 62

Функция ПолучитьОСВ62(Организация, Период)

	Параметры = мммСервер.ПодготовитьПараметрыОтчета(Организация,
		РегистрыСведений.Меппинг.ПолучитьЗамену(Организация, "62"),
		НачалоМесяца(Период),
		КонецМесяца(Период)
	);
	Параметры.Вставить("КолокиТаблицыЗначений", "Счет,СуммаНачальныйОстатокДт,СуммаНачальныйОстатокКт,СуммаОборотДт,СуммаОборотКт,СуммаКонечныйОстатокДт,СуммаКонечныйОстатокКт");

	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ОтчетОСВВызовСервера.СформироватьОтчетОСВ(Параметры, АдресХранилища);
	
	Данные = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если Данные.ТаблицаЗначений.Количество() > 0 Тогда
		ТекДанные = Данные.ТаблицаЗначений[0];
		
		Результат = Новый Массив;
		Результат.Добавить(Формат(ТекДанные.СуммаНачальныйОстатокДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаНачальныйОстатокКт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.ОборотДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.ОборотКт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаКонечныйОстатокДт, "ЧГ="));
		Результат.Добавить(Формат(ТекДанные.СуммаКонечныйОстатокКт, "ЧГ="));

		Возврат Результат;

	КонецЕсли;

	Возврат "";

КонецФункции

Функция СериализоватьКакСтроку(Массив)
	
	Возврат ?(ТипЗнч(Массив) = Тип("Массив"), СтрСоединить(Массив, "|"), "Ошибка");
	
КонецФункции
