Перем КомандаМестоНаДиске;
Перем ФайлМестоНаДиске;

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДанныеНаСерверах();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСерверах()

	ТаблицаСерверов = мммСервер.ПолучитьТаблицуСерверов(ТекущаяДата(),);
	ТаблицаСерверов.Свернуть("Сервер,База,Пользователь,Пароль,Пометка");
	
	ВыполняемыйКод = "WshShell=Новый COMОбъект(""Wscript.Shell"");
			|WshShell.run("""+КомандаМестоНаДиске+""");
			|Текст = Новый ТекстовыйДокумент;
			|Текст.Прочитать("""+ФайлМестоНаДиске+""");
			|МассивСтрок = Новый Массив;
			|Для Строка = 1 По Текст.КоличествоСтрок() Цикл
			|	МассивСтрок.Добавить(Текст.ПолучитьСтроку(Строка));
			|КонецЦикла;
			|ВозвращаемоеЗначение = МассивСтрок;";
	
	Для Каждого Сервер Из ТаблицаСерверов Цикл
		Если Не Сервер.Пометка ИЛИ Не ЗначениеЗаполнено(Сервер.Сервер) Тогда
			Продолжить;
		КонецЕсли;
		Прокси = Неопределено;
		Попытка
			Прокси = мммСервер.ПолучитьПрокси(Сервер.Сервер, Сервер.База, Сервер.Пользователь, Сервер.Пароль);
		Исключение
			ЗаписьЖурналаРегистрации("Мониторинг", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;
		Если Прокси = Неопределено тогда
			Возврат;
		КонецЕсли;

		ОтветСервиса = Прокси.RunCode(ВыполняемыйКод);
		Ответ = мммСервер.ДеСериализовать(ОтветСервиса);
		Если Не Ответ.Ошибка Тогда
		Иначе
			ЗаписьЖурналаРегистрации("Мониторинг", УровеньЖурналаРегистрации.Ошибка,,, Ответ.ОписаниеОшибки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

ФайлМестоНаДиске = "C:\temp\DiskSpace.log";
КомандаМестоНаДиске = 
	"@echo off
	||echo -- > "+ФайлМестоНаДиске+"
	||for /f """"skip=1 tokens=1-3"""" %%i in ('2^>nul ^
	||WMIC LogicalDisk ^
	||WHERE """"DriveType='3'"""" ^
	||GET Name^, Size^, FreeSpace') do (
	||echo %%i-%%j-%%k >> "+ФайлМестоНаДиске+"
	||)";