#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура УстановитьДатуЗапретаРедактирования(Параметры, АдресХранилища) Экспорт
	
	ТаблицаОрганизаций = мммСервер.ПолучитьТаблицуСерверов(ТекущаяДата(), Параметры.Организации);
	Для Каждого Организация Из ТаблицаОрганизаций Цикл
		СоединениеУстановлено = Ложь;
		Для сч = 1 По 3 Цикл
			Попытка
				Прокси = мммСервер.ПолучитьПрокси(Организация.Сервер, 
					Организация.База,
					Организация.Пользователь,
					Организация.Пароль
				);
				СоединениеУстановлено = Истина;
				Прервать;
			Исключение
				ЗаписьЖурналаРегистрации("Установка даты запрета редактирования", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		Если НЕ СоединениеУстановлено Тогда
			Продолжить;
		КонецЕсли;
		
		ВыполняемыйКод = СтрШаблон("Константы.MMMservice_ДатаЗапретаРедактированияБанковскихИКассовыхОпераций.Установить(%1,%2,%3);"
			, Формат(Год(Параметры.ДатаЗапрета), "ЧГ=")
			, Формат(Месяц(Параметры.ДатаЗапрета), "ЧГ=")
			, Формат(День(Параметры.ДатаЗапрета), "ЧГ=")
		);
		
		Ответ = Прокси.RunCode();
		
		Если НЕ Ответ.Ошибка Тогда
			Менеджер = РегистрыСведений.ДатыЗапретаРедактированияБанковскихИКассовыхОперацийОрганизаций.СоздатьМенеджерЗаписи();
			Менеджер.Период = ТекущаяДатаСеанса();
			Менеджер.Организация = Организация;
			Менеджер.ДатаЗапрета = Параметры.ДатаЗапрета;
			Менеджер.Записать();
		Иначе
			ЗаписьЖурналаРегистрации("Установка даты запрета редактирования", УровеньЖурналаРегистрации.Ошибка,,, "По организации "+Организация+Символы.ПС+Ответ.ОписаниеОшибки);
		КонецЕсли;

	КонецЦикла;
		
	ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
КонецПроцедуры

#КонецЕсли