#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура УстановитьДатуЗапретаРедактирования(Параметры, АдресХранилища) Экспорт
	
	ТаблицаОрганизаций = мммСервер.ПолучитьТаблицуСерверов(ТекущаяДата(), Параметры.Организации);
	сч = 1;
	Для Каждого Организация Из ТаблицаОрганизаций Цикл
		ДлительныеОперации.СообщитьПрогресс(Окр(100*(сч/ТаблицаОрганизаций.Количество())), Организация.Организация);
		СоединениеУстановлено = Ложь;
		Для сч = 1 По 3 Цикл
			Попытка
				Прокси = мммСервер.ПолучитьПрокси(Организация.Сервер, 
					Организация.База,
					Организация.Пользователь,
					Организация.Пароль
				);
				СоединениеУстановлено = Истина;
				Прервать;
			Исключение
				ЗаписьЖурналаРегистрации("Установка даты запрета редактирования", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		Если НЕ СоединениеУстановлено Тогда
			Продолжить;
		КонецЕсли;
		
		ВыполняемыйКод = СтрШаблон("Константы.MMMservice_ДатаЗапретаРедактированияБанковскихИКассовыхОпераций.Установить(Дата(""%1%2%3""));"
			, Формат(Год(Параметры.ДатаЗапрета), "ЧГ=")
			, Формат(Месяц(Параметры.ДатаЗапрета), "ЧГ=")
			, Формат(День(Параметры.ДатаЗапрета), "ЧГ=")
		);
		
		Ответ = мммСервер.ДеСериализовать(Прокси.RunCode(ВыполняемыйКод));
		
		Если НЕ Ответ.Ошибка Тогда
			Менеджер = РегистрыСведений.ДатыЗапретаРедактированияБанковскихИКассовыхОперацийОрганизаций.СоздатьМенеджерЗаписи();
			Менеджер.Период = ТекущаяДатаСеанса();
			Менеджер.Организация = Организация.Организация;
			Менеджер.ДатаЗапрета = Параметры.ДатаЗапрета;
			Менеджер.Записать();
		Иначе
			ЗаписьЖурналаРегистрации("Установка даты запрета редактирования", УровеньЖурналаРегистрации.Ошибка,,, "По организации "+Организация.Организация+Символы.ПС+Ответ.ОписаниеОшибки);
		КонецЕсли; 
		
		сч = сч + 1;

	КонецЦикла;
		
	ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
КонецПроцедуры

#КонецЕсли