
#Область ПрограммныйИнтерфейс

Функция Сериализовать(Об) Экспорт
	
	Возврат СериализоватьВСтрокуJSON(Об);
	
КонецФункции

Функция ДеСериализовать(Стр) Экспорт
	
	Возврат ДеСериализоватьИзСтрокиJSON(Стр);
	
КонецФункции

// Функция - Подготовить структуру ответа
//
// Параметры:
//  Ошибка			 - Булево	 - 
//  ОписаниеОшибки	 - Строка	 - 
//  Результат		 - ТаблицаЗначений, Неопределено	 - 
// 
// Возвращаемое значение:
//   - Структура
//
Функция ПодготовитьСтруктуруОтвета(Ошибка = Ложь, ОписаниеОшибки = "", Результат = Неопределено) Экспорт
	
	Ответ = Новый Структура;
	Ответ.Вставить("Ошибка", Ошибка);
	Ответ.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	Ответ.Вставить("Результат", Результат);
	
	Возврат Ответ;
	
КонецФункции	
	
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция СериализоватьВСтрокуJSON(Об)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	параметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(параметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Об, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции


Функция ДеСериализоватьИзСтрокиJSON(Стр)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Стр);
	Данные = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти
