// Возвращает структуру ЭтоКасса, СчетКассы
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Ссылка на организацию
//  Период		 - Дата - Дата среза
// 
// Возвращаемое значение:
// Структура - ЭтоКасса, СчетКассы
//
Функция ПолучитьДанныеКассыОрганизации(Организация, Период) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОрганизацииКассыСрезПоследних.ЭтоКасса КАК ЭтоКасса,
	               |	ОрганизацииКассыСрезПоследних.СчетКассы КАК СчетКассы
	               |ИЗ
	               |	РегистрСведений.ОрганизацииКассы.СрезПоследних(&Период, Организация = &Организация) КАК ОрганизацииКассыСрезПоследних";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ЭтоКасса,СчетКассы", Выборка.ЭтоКасса, Выборка.СчетКассы);
	КонецЕсли;

	Возврат Новый Структура("ЭтоКасса,СчетКассы", Ложь, Неопределено);

КонецФункции

Процедура ЗаполнитьКассыПриОбновлении() Экспорт

	Набор = РегистрыСведений.ОрганизацииКассы.СоздатьНаборЗаписей();
	Набор.Очистить();
	Набор.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(1980, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7807227468");	// жсмн
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.33";
	Менеджер.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(1980, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7807191719");	// звс
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.22";
	Менеджер.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(1980, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7807183186");	// бтк
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.11";
	Менеджер.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(2022, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7807236582");	// псйдн
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.3.1";
	Менеджер.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(2022, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7807244583");	// мгнт
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.1";
	Менеджер.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(2022, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7807244449");	// кнтр
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.1";
	Менеджер.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(2022, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7817122256");	// клрк
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.1";
	Менеджер.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(2022, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7817111857");	// трм
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.1";
	Менеджер.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(2022, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7817116982");	// плтн
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.1";
	Менеджер.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(2022, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7817120139");	// внтр
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.1";
	Менеджер.Записать();

	Менеджер = РегистрыСведений.ОрганизацииКассы.СоздатьМенеджерЗаписи();
	Менеджер.Период = Дата(2022, 1, 1);
	Менеджер.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7817121326");	// кнц
	Менеджер.ЭтоКасса = Истина;
	Менеджер.СчетКассы = "50.1";
	Менеджер.Записать();

КонецПроцедуры